IDEA StatiCa Open Model
EdgeOrientationType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Edge position type
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum EdgeOrientationType
Public Enumeration EdgeOrientationType
public enum class EdgeOrientationType
Members
Member name | Value | Description
FromBegin | 0 |  Distance measured from the beginning of edge
FromEnd | 1 |  Distance measured from the end of edge
See Also
Reference
IdeaRS.OpenModel.Detail Namespace